Tekla.Structures.ModelInternal.BentPlate
A class for the bent plate
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
using Tekla.Structures.ModelInternal;
public class Example
{
private ContourPlate CreateContourPlate(Point point1, Point point2, Point point3)
{
ContourPoint contourPoint1 =  new ContourPoint(point1, null);
ContourPoint contourPoint2 = new ContourPoint(point2, null);
ContourPoint contourPoint3 = new ContourPoint(point3, null);
ContourPlate CP = new ContourPlate();
CP.AddContourPoint(contourPoint1);
CP.AddContourPoint(contourPoint2);
CP.AddContourPoint(contourPoint3);
CP.Finish = "FOO";
CP.Profile.ProfileString = "PL200";
CP.Material.MaterialString = "K30-2";
CP.Insert();
return CP;
}
public void Example1()
{
Point point1 = new Point(0, 4000, 1000);
Point point2 = new Point(2000, 4000, 1000);
Point point3 = new Point(0, 6000, 3000);
Point point4 = new Point(0, 0, 0);
Point point5 = new Point(0, 2000, 0);
Point point6 = new Point(2000, 2000, 0);
Part contourPlate1 = CreateContourPlate(point1, point2, point3);
Part contourPlate2 = CreateContourPlate(point4, point5, point6);
BentPlate bentPlate = BentPlate.CreateByParts(contourPlate1, contourPlate2);
}
}

Tekla.Structures.ModelInternal.BentPlate.geometry
The geometry of the bent plate

Tekla.Structures.ModelInternal.BentPlate.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.BentPlate class.

Tekla.Structures.ModelInternal.BentPlate.Insert
Not implemented. Use instead CreateByPart() or CreateByFaces()
Returns: false

Tekla.Structures.ModelInternal.BentPlate.Select
Selects a bent plate object from the db.
Returns: True if success

Tekla.Structures.ModelInternal.BentPlate.Delete
Deletes the bent plate object.
Returns: True if success

Tekla.Structures.ModelInternal.BentPlate.Modify
Modifies the bent plate object values in the db.
Returns: True if success

Tekla.Structures.ModelInternal.BentPlate.CreateByParts(Tekla.Structures.Model.Part,Tekla.Structures.Model.Part)
Creates and inserts a new Tekla.Structures.ModelInternal.BentPlate instance based on two parts.
part1: One part used for creating the bent plate
part2: The other part used for creating the bent plate
Returns: Bent plate object if successful, null otherwise

Tekla.Structures.ModelInternal.BentPlate.CreateByFaces(Tekla.Structures.Model.Part,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Vector},Tekla.Structures.Model.Part,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Vector})
Creates and inserts a new Tekla.Structures.ModelInternal.BentPlate instance based on two parts and a selected face in each part.
part1: The first part
face1: The face on the first part
part2: The second part
face2: The face on the second part
Returns: Bent plate object if successful, null otherwise

Tekla.Structures.ModelInternal.BentPlate.CreateByFaces(Tekla.Structures.Model.Part,System.Collections.ArrayList,Tekla.Structures.Model.Part,System.Collections.ArrayList)
Creates and inserts a new Tekla.Structures.ModelInternal.BentPlate instance based on two parts and selected faces in each part.
part1: The first part.
faces1: The selected faces on the first part.
part2: The second part.
faces2: The selected faces on the second part.

Tekla.Structures.ModelInternal.BentPlate.ModifyRadius(System.Int32,System.Double)
Modify radius of a Tekla.Structures.ModelInternal.BentPlate cylindrical geometry node.
geometryNodeId: The index of the geometry node, which is its rank in the breadth-first traversal of the geometry tree (root id is 1).
radius: The new radius.

Tekla.Structures.ModelInternal.BentPlate.FetchAllNodes
Retrieves all geometry nodes of the bent plate in breadth-first traversal.
Returns: The list of cylindrical curved nodes in this bent plate.

Tekla.Structures.ModelInternal.BentPlate.BentPlateParametersCheck
Examines whether bent plate parameters are well defined

Tekla.Structures.ModelInternal.BentPlate.FaceVerticesToPolygon(Tekla.Structures.ModelInternal.dotPolygon_t@,System.Collections.Generic.IList{Tekla.Structures.Geometry3d.Vector})
Converts face vertices into a polygon for passing them to the TS core
facePolygon: Outputs an ordered polygon determining the face corner points
currentLoopPoints: The face loop points

Tekla.Structures.ModelInternal.BentPlate.SelectInstance
Selects an instance of a bent plate
Returns: True if success

Tekla.Structures.ModelInternal.BentPlate.GetThickness
The thickness of the bent plate.
Returns: The bent plate thickness

Tekla.Structures.ModelInternal.BentPlate.Geometry
The geometry of bent plate.